MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_mpu.c
/*******************************************************************************
 * Copyright (C) 2016, Huada Semiconductor Co., Ltd. All rights reserved.
 *
 * This software is owned and published by:
 * Huada Semiconductor Co., Ltd. ("HDSC").
 *
 * BY DOWNLOADING, INSTALLING OR USING THIS SOFTWARE, YOU AGREE TO BE BOUND
 * BY ALL THE TERMS AND CONDITIONS OF THIS AGREEMENT.
 *
 * This software contains source code for use with HDSC
 * components. This software is licensed by HDSC to be adapted only
 * for use in systems utilizing HDSC components. HDSC shall not be
 * responsible for misuse or illegal use of this software for devices not
 * supported herein. HDSC is providing this software "AS IS" and will
 * not be responsible for issues arising from incorrect user implementation
 * of the software.
 *
 * Disclaimer:
 * HDSC MAKES NO WARRANTY, EXPRESS OR IMPLIED, ARISING BY LAW OR OTHERWISE,
 * REGARDING THE SOFTWARE (INCLUDING ANY ACCOMPANYING WRITTEN MATERIALS),
 * ITS PERFORMANCE OR SUITABILITY FOR YOUR INTENDED USE, INCLUDING,
 * WITHOUT LIMITATION, THE IMPLIED WARRANTY OF MERCHANTABILITY, THE IMPLIED
 * WARRANTY OF FITNESS FOR A PARTICULAR PURPOSE OR USE, AND THE IMPLIED
 * WARRANTY OF NONINFRINGEMENT.
 * HDSC SHALL HAVE NO LIABILITY (WHETHER IN CONTRACT, WARRANTY, TORT,
 * NEGLIGENCE OR OTHERWISE) FOR ANY DAMAGES WHATSOEVER (INCLUDING, WITHOUT
 * LIMITATION, DAMAGES FOR LOSS OF BUSINESS PROFITS, BUSINESS INTERRUPTION,
 * LOSS OF BUSINESS INFORMATION, OR OTHER PECUNIARY LOSS) ARISING FROM USE OR
 * INABILITY TO USE THE SOFTWARE, INCLUDING, WITHOUT LIMITATION, ANY DIRECT,
 * INDIRECT, INCIDENTAL, SPECIAL OR CONSEQUENTIAL DAMAGES OR LOSS OF DATA,
 * SAVINGS OR PROFITS,
 * EVEN IF Disclaimer HAS BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.
 * YOU ASSUME ALL RESPONSIBILITIES FOR SELECTION OF THE SOFTWARE TO ACHIEVE YOUR
 * INTENDED RESULTS, AND FOR THE INSTALLATION OF, USE OF, AND RESULTS OBTAINED
 * FROM, THE SOFTWARE.
 *
 * This software may be replicated in part or whole for the licensed use,
 * with the restriction that this Disclaimer and Copyright notice must be
 * included with each copy of this software, whether used in part or whole,
 * at all times.
 */
/******************************************************************************/
/** \file hc32f46x_mpu.c
 **
 ** A detailed description is available at
 ** @link MpuGroup MPU description @endlink
 **
 **   - 2018-10-20  1.0 Hongjh First version for Device Driver Library of MPU.
 **
 ******************************************************************************/

/*******************************************************************************
 * Include files
 ******************************************************************************/
#include "hc32f46x_mpu.h"
#include "hc32f46x_utility.h"

#if (DDL_MPU_ENABLE == DDL_ON)

/**
 *******************************************************************************
 ** \addtogroup MpuGroup
 ******************************************************************************/

//@{

/*******************************************************************************
 * Local type definitions ('typedef')
 ******************************************************************************/

/*******************************************************************************
 * Local pre-processor symbols/macros ('#define')
 ******************************************************************************/

/*!< Parameter valid check for MPU region number. */
#define IS_VALID_MPU_REGION_NUM(x) \
    ((MpuRegionNum0 == (x)) ||     \
     (MpuRegionNum1 == (x)) ||     \
     (MpuRegionNum2 == (x)) ||     \
     (MpuRegionNum3 == (x)) ||     \
     (MpuRegionNum4 == (x)) ||     \
     (MpuRegionNum5 == (x)) ||     \
     (MpuRegionNum6 == (x)) ||     \
     (MpuRegionNum7 == (x)) ||     \
     (MpuRegionNum8 == (x)) ||     \
     (MpuRegionNum9 == (x)) ||     \
     (MpuRegionNum10 == (x)) ||    \
     (MpuRegionNum11 == (x)) ||    \
     (MpuRegionNum12 == (x)) ||    \
     (MpuRegionNum13 == (x)) ||    \
     (MpuRegionNum14 == (x)) ||    \
     (MpuRegionNum15 == (x)))

/*!< Parameter valid check for MPU region size. */
#define IS_VALID_MPU_REGION_SIZE(x)    \
    ((MpuRegionSize32Byte == (x)) ||   \
     (MpuRegionSize64Byte == (x)) ||   \
     (MpuRegionSize128Byte == (x)) ||  \
     (MpuRegionSize256Byte == (x)) ||  \
     (MpuRegionSize512Byte == (x)) ||  \
     (MpuRegionSize1KByte == (x)) ||   \
     (MpuRegionSize2KByte == (x)) ||   \
     (MpuRegionSize4KByte == (x)) ||   \
     (MpuRegionSize8KByte == (x)) ||   \
     (MpuRegionSize16KByte == (x)) ||  \
     (MpuRegionSize32KByte == (x)) ||  \
     (MpuRegionSize64KByte == (x)) ||  \
     (MpuRegionSize128KByte == (x)) || \
     (MpuRegionSize256KByte == (x)) || \
     (MpuRegionSize512KByte == (x)) || \
     (MpuRegionSize1MByte == (x)) ||   \
     (MpuRegionSize2MByte == (x)) ||   \
     (MpuRegionSize4MByte == (x)) ||   \
     (MpuRegionSize8MByte == (x)) ||   \
     (MpuRegionSize16MByte == (x)) ||  \
     (MpuRegionSize32MByte == (x)) ||  \
     (MpuRegionSize64MByte == (x)) ||  \
     (MpuRegionSize128MByte == (x)) || \
     (MpuRegionSize256MByte == (x)) || \
     (MpuRegionSize512MByte == (x)) || \
     (MpuRegionSize1GByte == (x)) ||   \
     (MpuRegionSize2GByte == (x)) ||   \
     (MpuRegionSize4GByte == (x)))

/*!< Parameter valid check for MPU region type. */
#define IS_VALID_MPU_REGION_TYPE(x) \
    ((SMPU1Region == (x)) ||        \
     (SMPU2Region == (x)) ||        \
     (FMPURegion == (x)))

/*!< Parameter valid check for MPU action. */
#define IS_VALID_MPU_ACTION(x) \
    ((MpuTrigNmi == (x)) ||    \
     (MpuTrigReset == (x)) ||  \
     (MpuNoneAction == (x)) || \
     (MpuTrigBusError == (x)))

/******************************************************************************/
/*                                     MPU                                    */
/******************************************************************************/
/*!< Get the RGD register address of the specified MPU region */
#define MPU_RGDx(__REGION_NUM__) ((uint32_t)(&M4_MPU->RGD0) + ((uint32_t)(__REGION_NUM__)) * 4u)

/*!< Get the RGCR register address of the specified MPU region */
#define MPU_RGCRx(__REGION_NUM__) ((uint32_t)(&M4_MPU->RGCR0) + ((uint32_t)(__REGION_NUM__)) * 4u)

