MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_mpu.c
/*!< MPU RGD register: RGADDR position */
#define MPU_RGD_RGADDR_Pos (5u) /*!< MPU_RGD: RGADDR Position */

/*!< MPU write protection key */
#define MPU_WRITE_PROT_KEY (0x96A4ul)

/*******************************************************************************
 * Global variable definitions (declared in header file with 'extern')
 ******************************************************************************/

/*******************************************************************************
 * Local function prototypes ('static')
 ******************************************************************************/

/*******************************************************************************
 * Local variable definitions ('static')
 ******************************************************************************/

/*******************************************************************************
 * Function implementation - global ('extern') and local ('static')
 ******************************************************************************/

/**
 *******************************************************************************
 ** \brief Configure MPU protect region.
 **
 ** \param [in] enRegionNum             MPU region number
 ** \arg This parameter can be a value of @ref en_mpu_region_num_t
 ** \param [in] pstcInitCfg             Pointer to MPU protection region configuration structure
 ** \arg the structure detail refer @ref stc_mpu_prot_region_init_t
 **
 ** \retval Ok                          Set successfully
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - pstcInitCfg == NULL
 **                                     - pstcInitCfg->u32RegionBaseAddress is invalid
 **                                     - Other invalid configuration
 **
 ******************************************************************************/
en_result_t MPU_ProtRegionInit(en_mpu_region_num_t enRegionNum,
                               const stc_mpu_prot_region_init_t *pstcInitCfg)
{
    en_result_t enRet = ErrorInvalidParameter;
    uint32_t u32WriteProt = M4_MPU->WP;
    stc_mpu_rgd0_field_t *RGD_f = NULL;
    stc_mpu_rgcr0_field_t *RGCR_f = NULL;

    /* Check pointer parameters */
    if (NULL != pstcInitCfg)
    {
        DDL_ASSERT(IS_VALID_MPU_REGION_NUM(enRegionNum));
        DDL_ASSERT(IS_VALID_MPU_REGION_SIZE(pstcInitCfg->enRegionSize));
        DDL_ASSERT(IS_VALID_MPU_ACTION(pstcInitCfg->stcSMPU1Permission.enAction));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcSMPU1Permission.enRegionEnable));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcSMPU1Permission.enWriteEnable));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcSMPU1Permission.enReadEnable));
        DDL_ASSERT(IS_VALID_MPU_ACTION(pstcInitCfg->stcSMPU2Permission.enAction));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcSMPU2Permission.enRegionEnable));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcSMPU2Permission.enWriteEnable));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcSMPU2Permission.enReadEnable));
        DDL_ASSERT(IS_VALID_MPU_ACTION(pstcInitCfg->stcFMPUPermission.enAction));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcFMPUPermission.enRegionEnable));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcFMPUPermission.enWriteEnable));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcFMPUPermission.enReadEnable));

        /* Check base address and region size */
        if (!(pstcInitCfg->u32RegionBaseAddress & (~(0xFFFFFFFFUL << ((uint32_t)pstcInitCfg->enRegionSize + 1UL)))))
        {
            /* Disable write protection of MPU register */
            M4_MPU->WP = (MPU_WRITE_PROT_KEY | 1ul);

            /*  Get RGD && RGCR register address */
            RGD_f = (stc_mpu_rgd0_field_t *)MPU_RGDx(enRegionNum);
            RGCR_f = (stc_mpu_rgcr0_field_t *)MPU_RGCRx(enRegionNum);

            /* Disable region protection function */
            RGCR_f->FRG0E = (uint32_t)0ul;
            RGCR_f->S1RG0E = (uint32_t)0ul;
            RGCR_f->S2RG0E = (uint32_t)0ul;

            /* Set region size */
            RGD_f->MPURG0SIZE = (uint32_t)(pstcInitCfg->enRegionSize);

            /* Set region base address */
            RGD_f->MPURG0ADDR = (pstcInitCfg->u32RegionBaseAddress >> MPU_RGD_RGADDR_Pos);

            /* Set region FMPU */
            RGCR_f->FRG0RP = (pstcInitCfg->stcFMPUPermission.enReadEnable) ? 0ul : 1ul;
            RGCR_f->FRG0WP = (pstcInitCfg->stcFMPUPermission.enWriteEnable) ? 0ul : 1ul;
            RGCR_f->FRG0E = (uint32_t)(pstcInitCfg->stcFMPUPermission.enRegionEnable);
            M4_MPU->CR_f.FMPUACT = (uint32_t)(pstcInitCfg->stcFMPUPermission.enAction);

            /* Set region SMPU1 */
            RGCR_f->S1RG0RP = (pstcInitCfg->stcSMPU1Permission.enReadEnable) ? 0ul : 1ul;
            RGCR_f->S1RG0WP = (pstcInitCfg->stcSMPU1Permission.enWriteEnable) ? 0ul : 1ul;
            RGCR_f->S1RG0E = (uint32_t)(pstcInitCfg->stcSMPU1Permission.enRegionEnable);
            M4_MPU->CR_f.SMPU1ACT = (uint32_t)(pstcInitCfg->stcSMPU1Permission.enAction);

            /* Set region SMPU2 */
            RGCR_f->S2RG0RP = (pstcInitCfg->stcSMPU2Permission.enReadEnable) ? 0ul : 1ul;
            RGCR_f->S2RG0WP = (pstcInitCfg->stcSMPU2Permission.enWriteEnable) ? 0ul : 1ul;
            RGCR_f->S2RG0E = (uint32_t)(pstcInitCfg->stcSMPU2Permission.enRegionEnable);
            M4_MPU->CR_f.SMPU2ACT = (uint32_t)(pstcInitCfg->stcSMPU2Permission.enAction);

            /* Recover write protection of MPU register */
            M4_MPU->WP = (MPU_WRITE_PROT_KEY | u32WriteProt);
            enRet = Ok;
        }
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Configure MPU background region.
 **
 ** \param [in] pstcInitCfg             Pointer to MPU background region configuration structure
 ** \arg the structure detail refer @ref stc_mpu_bkgd_region_init_t
 **
 ** \retval Ok                          Set successfully
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - pstcInitCfg == NULL
 **                                     - pstcInitCfg->u32RegionBaseAddress is invalid
 **                                     - Other invalid configuration
 **
 ******************************************************************************/
en_result_t MPU_BkgdRegionInit(const stc_mpu_bkgd_region_init_t *pstcInitCfg)
{
    uint32_t u32WriteProt = M4_MPU->WP;
    en_result_t enRet = ErrorInvalidParameter;

    /* Check pointer parameters */
    if (NULL != pstcInitCfg)
    {
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcSMPU1BkgdPermission.enWriteEnable));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcSMPU1BkgdPermission.enReadEnable));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcSMPU2BkgdPermission.enWriteEnable));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcSMPU2BkgdPermission.enReadEnable));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcFMPUBkgdPermission.enWriteEnable));
        DDL_ASSERT(IS_FUNCTIONAL_STATE(pstcInitCfg->stcFMPUBkgdPermission.enReadEnable));

        /* Disable write protection of MPU register */
        M4_MPU->WP = (MPU_WRITE_PROT_KEY | 1ul);

