MarlinFirmware/Marlin/Marlin/lib/h32_core/drivers/library/src/hc32f46x_mpu.c
    DDL_ASSERT(IS_VALID_MPU_REGION_TYPE(enMpuRegionType));

    switch (enMpuRegionType)
    {
    case SMPU1Region:
        u32ActionSel = M4_MPU->CR_f.SMPU1ACT;
        break;
    case SMPU2Region:
        u32ActionSel = M4_MPU->CR_f.SMPU2ACT;
        break;
    case FMPURegion:
        u32ActionSel = M4_MPU->CR_f.FMPUACT;
        break;
    default:
        break;
    }

    return (en_mpu_action_sel_t)(u32ActionSel);
}

/**
 *******************************************************************************
 ** \brief Set MPU function of the specified region and type.
 **
 ** \param [in] enRegionNum             MPU region number
 ** \arg This parameter can be a value of @ref en_mpu_region_num_t
 ** \param [in] enMpuRegionType         the specified region type
 ** \arg SMPU1Region                    System DMA_1 MPU
 ** \arg SMPU2Region                    System DMA_2 MPU
 ** \arg FMPURegion                     System USBFS_DMA MPU
 ** \param [in] enState                 MPU region state
 ** \arg Enable                         Enable the specified MPU region function
 ** \arg Disable                        Disable the specified MPU region function
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - enMpuRegionType is invalid
 **
 ******************************************************************************/
en_result_t MPU_ProtRegionCmd(en_mpu_region_num_t enRegionNum,
                              en_mpu_region_type_t enMpuRegionType,
                              en_functional_state_t enState)
{
    en_result_t enRet = Ok;
    stc_mpu_rgcr0_field_t *RGCR_f = NULL;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));
    DDL_ASSERT(IS_VALID_MPU_REGION_NUM(enRegionNum));
    DDL_ASSERT(IS_VALID_MPU_REGION_TYPE(enMpuRegionType));

    RGCR_f = (stc_mpu_rgcr0_field_t *)MPU_RGCRx(enRegionNum);

    switch (enMpuRegionType)
    {
    case SMPU1Region:
        RGCR_f->S1RG0E = (uint32_t)enState;
        break;
    case SMPU2Region:
        RGCR_f->S2RG0E = (uint32_t)enState;
        break;
    case FMPURegion:
        RGCR_f->FRG0E = (uint32_t)enState;
        break;
    default:
        enRet = ErrorInvalidParameter;
        break;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set MPU function of the specified region type.
 **
 ** \param [in] enMpuRegionType         the specified region type
 ** \arg SMPU1Region                    System DMA_1 MPU
 ** \arg SMPU2Region                    System DMA_2 MPU
 ** \arg FMPURegion                     System USBFS_DMA MPU
 ** \param [in] enState                 MPU region state
 ** \arg Enable                         Enable the specified type region function of MPU
 ** \arg Disable                        Disable the specified type region function of MPU
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       If one of following cases matches:
 **                                     - enMpuRegionType is invalid
 **
 ******************************************************************************/
en_result_t MPU_RegionTypeCmd(en_mpu_region_type_t enMpuRegionType,
                              en_functional_state_t enState)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));
    DDL_ASSERT(IS_VALID_MPU_REGION_TYPE(enMpuRegionType));

    switch (enMpuRegionType)
    {
    case SMPU1Region:
        M4_MPU->CR_f.SMPU1E = (uint32_t)enState;
        break;
    case SMPU2Region:
        M4_MPU->CR_f.SMPU2E = (uint32_t)enState;
        break;
    case FMPURegion:
        M4_MPU->CR_f.FMPUE = (uint32_t)enState;
        break;
    default:
        enRet = ErrorInvalidParameter;
        break;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Get MPU status
 **
 ** \param [in] enMpuRegionType         the specified region type
 ** \arg SMPU1Region                    System DMA_1 MPU
 ** \arg SMPU2Region                    System DMA_2 MPU
 ** \arg FMPURegion                     System USBFS_DMA MPU
 **
 ** \retval Set                         Flag is set.
 ** \retval Reset                       Flag is reset or enMpuRegionType is invalid.
 **
 ******************************************************************************/
en_flag_status_t MPU_GetStatus(en_mpu_region_type_t enMpuRegionType)
{
    uint32_t u32Flag = 0ul;

    DDL_ASSERT(IS_VALID_MPU_REGION_TYPE(enMpuRegionType));

    switch (enMpuRegionType)
    {
    case SMPU1Region:
        u32Flag = M4_MPU->SR_f.SMPU1EAF;
        break;
    case SMPU2Region:
        u32Flag = M4_MPU->SR_f.SMPU2EAF;
        break;
    case FMPURegion:
        u32Flag = M4_MPU->SR_f.FMPUEAF;
        break;
    default:
        break;
    }

    return (en_flag_status_t)(u32Flag);
}

/**
 *******************************************************************************
 ** \brief Clear MPU status.
 **
 ** \param [in] enMpuRegionType         the specified region type
 ** \arg SMPU1Region                    System DMA_1 MPU
 ** \arg SMPU2Region                    System DMA_2 MPU
 ** \arg FMPURegion                     System USBFS_DMA MPU
 **
 ** \retval Ok                          Clear flag successfully.
 ** \retval ErrorInvalidParameter       enMpuRegionType is invalid
 **
 ******************************************************************************/
en_result_t MPU_ClearStatus(en_mpu_region_type_t enMpuRegionType)
{
    en_result_t enRet = Ok;

    DDL_ASSERT(IS_VALID_MPU_REGION_TYPE(enMpuRegionType));

    switch (enMpuRegionType)
    {
    case SMPU1Region:
        M4_MPU->ECLR_f.SMPU1ECLR = 1u;
        break;
    case SMPU2Region:
        M4_MPU->ECLR_f.SMPU2ECLR = 1u;
        break;
    case FMPURegion:
        M4_MPU->ECLR_f.FMPUECLR = 1u;
        break;
    default:
        enRet = ErrorInvalidParameter;
        break;
    }

    return enRet;
}

/**
 *******************************************************************************
 ** \brief Set MPU read permission of the specified protection region and enMpuRegionType.
 **
 ** \param [in] enRegionNum             MPU region number
 ** \arg This parameter can be a value of @ref en_mpu_region_num_t
 ** \param [in] enMpuRegionType         MPU region type
 ** \arg SMPU1Region                    System DMA_1 MPU
 ** \arg SMPU2Region                    System DMA_2 MPU
 ** \arg FMPURegion                     System USBFS_DMA MPU
 ** \param [in] enState                 MPU region state
 ** \arg Enable                         Enable the specified MPU region read permission
 ** \arg Disable                        Disable the specified MPU region read permission
 **
 ** \retval Ok                          Set successfully.
 ** \retval ErrorInvalidParameter       enMpuRegionType is invalid
 **
 ******************************************************************************/
en_result_t MPU_SetProtRegionReadPermission(en_mpu_region_num_t enRegionNum,
                                            en_mpu_region_type_t enMpuRegionType,
                                            en_functional_state_t enState)
{
    en_result_t enRet = Ok;
    stc_mpu_rgcr0_field_t *RGCR_f = NULL;

    DDL_ASSERT(IS_FUNCTIONAL_STATE(enState));
    DDL_ASSERT(IS_VALID_MPU_REGION_NUM(enRegionNum));
    DDL_ASSERT(IS_VALID_MPU_REGION_TYPE(enMpuRegionType));

    RGCR_f = (stc_mpu_rgcr0_field_t *)MPU_RGCRx(enRegionNum);

